ТренировкаОбмен/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТренировкаОбмен/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
    РаботаСДокументами.РасчетСуммы(СтрокаСписокНоменклатуры);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
    РаботаСДокументами.РасчетСуммы(СтрокаСписокНоменклатуры);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РасчетЦены(СтрокаСписокНоменклатуры);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные; 
	
	СтрокаСписокНоменклатуры.Цена = РаботаСоСправочниками.РозничнаяЦена(СтрокаСписокНоменклатуры.Номенклатура, Объект.Дата); 
	
    РаботаСДокументами.РасчетСуммы(СтрокаСписокНоменклатуры); 
	
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма"); 
	
КонецПроцедуры
